app/controllers/users_controller.rb

INSERT INTO "users" ("name", "age", "created_at", "updated_at", "city", "email") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Sima"], ["age", 20], ["created_at", "2021-02-11 07:32:59.906276"], ["updated_at", "2021-02-11 07:32:59.906276"], ["city", "pune"], ["email", "sima@gmail.com"]]
---
    def create

        @user = User.create(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = ?, "dob" = ?, "encrypted_password" = ? WHERE "users"."id" = ?  [["updated_at", "2021-02-13 11:14:45.156533"], ["dob", "2021-02-05"], ["encrypted_password", "$2a$12$rRnqtVQXkZjkg1edO/EMa.5rqNoZNC9Q.MHmkWNIMBEei4Qk6Ga8S"], ["id", 2]]
UPDATE "users" SET "encrypted_password" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["encrypted_password", "$2a$12$u9mbWHG09MrFJa5.2tFUK.eVAwvGZ19I5Sonwd9l5NLBRxFoa7ZuW"], ["updated_at", "2021-02-13 11:14:19.833510"], ["id", 2]]
---
    def update
        @user = User.find(params[:id])
        @user.update(user_params)
        if @user.update(user_params)